In [2]:
# Se ainda não tiver o SQLite instalado, instale a biblioteca:

# !pip install sqlite3 pandas sqlalchemy

In [3]:
import sqlite3
import pandas as pd
from sqlalchemy import create_engine

In [4]:
# Carregando dataframe para este notebook:

df = pd.read_csv(r"C:\Users\felip\OneDrive\Desktop\Estudos e Trabalhos\DSP - Data Science Project\Nível 1\Projeto 1 - Ciência de Dados\data\processed\vendas.csv")
df.head()

,data_venda,produto,categoria,preco,quantidade,unidade,vendedor
0,2024-01-22,Notebook,Eletronicos,4598.00,3,Shopping West-Plaza,Fernanda
1,2024-02-15,Camiseta,Roupas,49.99,10,Shopping West-Plaza,Fernanda
2,2024-12-17,Celular,Eletronicos,6699.99,7,Shopping West-Plaza,Pedro
3,2024-10-15,Cafeteira,Eletronicos,200.00,7,Jundiai,Mariana
4,2024-10-11,Camiseta,Roupas,49.99,4,Contagem,Fernanda

In [5]:
# Criando conexão com o SQLite

# Conectar o banco de dados
conn = sqlite3.connect("vendas.db")
cursor = conn.cursor()

In [6]:
# Criar tabela 

cursor.execute("""
    CREATE TABLE IF NOT EXISTS vendas (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        produto TEXT,
        categoria TEXT,
        quantidade INTEGER,
        preco REAL,
        data_venda DATE,
        unidade TEXT,
        vendedor TEXT
        
    )
""")
conn.commit()  # Salva as mudanças

In [7]:
# Inserir os dados do dataframe no SQL

# Recriar o engine para garantir a conexão com SQLAlchemy
engine = create_engine("sqlite:///vendas.db")

# Inserir os dados no banco
df.to_sql("vendas", con=engine, if_exists="replace", index=False)

print("✅ Dados inseridos com sucesso!")

✅ Dados inseridos com sucesso!

In [8]:
# Realização de consulta

df_consulta = pd.read_sql("SELECT * FROM vendas LIMIT 5", con=engine)
print(df_consulta)

   data_venda    produto    categoria    preco  quantidade  \
0  2024-01-22   Notebook  Eletronicos  4598.00           3
1  2024-02-15   Camiseta       Roupas    49.99          10
2  2024-12-17    Celular  Eletronicos  6699.99           7
3  2024-10-15  Cafeteira  Eletronicos   200.00           7
4  2024-10-11   Camiseta       Roupas    49.99           4

               unidade  vendedor
0  Shopping West-Plaza  Fernanda
1  Shopping West-Plaza  Fernanda
2  Shopping West-Plaza     Pedro
3              Jundiai   Mariana
4             Contagem  Fernanda

In [9]:
# Explorar a Estrutura da Tabela

cursor.execute("PRAGMA table_info(vendas)")
tabela_info = cursor.fetchall()
for coluna in tabela_info:
    print(coluna) # Retorna informações sobre as colunas da tabela

(0, 'data_venda', 'TEXT', 0, None, 0)
(1, 'produto', 'TEXT', 0, None, 0)
(2, 'categoria', 'TEXT', 0, None, 0)
(3, 'preco', 'FLOAT', 0, None, 0)
(4, 'quantidade', 'BIGINT', 0, None, 0)
(5, 'unidade', 'TEXT', 0, None, 0)
(6, 'vendedor', 'TEXT', 0, None, 0)

In [10]:
# Vizualizar algumas linhas dos dados

df_consulta = pd.read_sql("SELECT * FROM vendas LIMIT 5", conn)
print(df_consulta)

   data_venda    produto    categoria    preco  quantidade  \
0  2024-01-22   Notebook  Eletronicos  4598.00           3
1  2024-02-15   Camiseta       Roupas    49.99          10
2  2024-12-17    Celular  Eletronicos  6699.99           7
3  2024-10-15  Cafeteira  Eletronicos   200.00           7
4  2024-10-11   Camiseta       Roupas    49.99           4

               unidade  vendedor
0  Shopping West-Plaza  Fernanda
1  Shopping West-Plaza  Fernanda
2  Shopping West-Plaza     Pedro
3              Jundiai   Mariana
4             Contagem  Fernanda

In [11]:
# Realização de consultas explorativas

# Total de vendas por categoria de produto:
df_categoria = pd.read_sql("""
    SELECT categoria, SUM(quantidade) AS total_vendas
    FROM vendas
    GROUP BY categoria
    ORDER BY total_vendas DESC
""", conn)
print(df_categoria)

          categoria  total_vendas
0       Eletronicos          8564
1            Roupas          4036
2          Educacao          1949
3  Saude, Bem Estar          1934

In [12]:
# Realização de consultas explorativas

# Total de vendas por produtos mais vendidos:
df_top_produtos = pd.read_sql("""
    SELECT produto, SUM(quantidade) AS total_vendido
    FROM vendas
    GROUP BY produto
    ORDER BY total_vendido DESC
    LIMIT 10
""", conn)
print(df_top_produtos)

              produto  total_vendido
0           Cafeteira           2198
1            Notebook           2158
2  Fone de ouvido JBL           2134
3             Celular           2074
4               Tenis           2054
5            Camiseta           1982
6               Livro           1949
7        Umidificador           1934

In [13]:
# Realização de consultas explorativas

# Receita total por produto:
df_receita = pd.read_sql("""
    SELECT produto, SUM(quantidade * preco) AS receita_total
    FROM vendas
    GROUP BY produto
    ORDER BY receita_total DESC
""", conn)
print(df_receita)

              produto  receita_total
0             Celular    13895779.26
1            Notebook     9922484.00
2  Fone de ouvido JBL      640178.66
3           Cafeteira      439600.00
4        Umidificador      367440.66
5               Tenis      308079.46
6            Camiseta       99080.18
7               Livro       77940.51

In [14]:
# Realização de consultas explorativas

# Quantidade total de vendas por vendedor
df_vendedor = pd.read_sql("""
    SELECT vendedor, SUM(quantidade) AS total_vendido
    FROM vendas
    GROUP BY vendedor
    ORDER BY total_vendido DESC
""", conn)
print(df_vendedor)

   vendedor  total_vendido
0    Carlos           3526
1       Ana           3396
2     Pedro           3312
3   Mariana           3154
4  Fernanda           3095

In [15]:
# Realização de consultas explorativas

# Receita total gerada por cada vendedor
df_receita = pd.read_sql("""
    SELECT vendedor, 
        SUM(quantidade) AS total_vendido,
        SUM(quantidade * preco) AS receita_total
    FROM vendas
    GROUP BY vendedor
    ORDER BY total_vendido DESC
""", conn)
print(df_receita)

   vendedor  total_vendido  receita_total
0    Carlos           3526     5819455.04
1       Ana           3396     5176964.88
2     Pedro           3312     5082276.24
3   Mariana           3154     4873418.17
4  Fernanda           3095     4798468.40

In [16]:
# Realização de consultas explorativas

# Quantidade total de vendas por unidade
df_unidade = pd.read_sql("""
    SELECT unidade, SUM(quantidade) AS total_vendido
    FROM vendas
    GROUP BY unidade
    ORDER BY total_vendido DESC
""", conn)
print(df_unidade)

                unidade  total_vendido
0  Sao Jose dos Pinhais           4338
1   Shopping West-Plaza           4101
2               Jundiai           4085
3              Contagem           3959

In [17]:
# Realização de consultas explorativas

# Receita total gerada por cada vendedor
df_runidade = pd.read_sql("""
    SELECT unidade, 
        SUM(quantidade) AS total_vendido,
        SUM(quantidade * preco) AS receita_total
    FROM vendas
    GROUP BY unidade
    ORDER BY total_vendido DESC
""", conn)
print(df_runidade)

                unidade  total_vendido  receita_total
0  Sao Jose dos Pinhais           4338     7220411.16
1   Shopping West-Plaza           4101     5951579.10
2               Jundiai           4085     6579809.65
3              Contagem           3959     5998782.82